// შექმენით ხმის მიცემის უფლების შემმოწმებელი ფუნქცია. თუ მომხმარებლის ასაკი ნაკლებია 18-ზე უნდა გამოჩნდეს, რომ მას არ შეუძლია ხმის მიცემა, თუ მისი ასაკი მეტია 18-ზე უნდა გამოჩნდეს, რომ მომხმარებელს შეუძლია ხმის მიცემა.

function checkVote (age) {

    if (age < 18 && age > 0) {
        return "შენ არ შეგიძლია ხმის მიცემა"
    } else if (age < 0) {
        return "ასაკის მნიშვნელობა ვერ იქნება უაროფითი"
    } else {
        return "შენ შეგიძლია ხმის მიცემა"
    }
}


console.log(checkVote(16));
console.log(checkVote(18));
console.log(checkVote(21));
console.log(checkVote(-2));

